projects/openfoam/rarefied-flows/impingment/sims/templates/compressible/rhoCentralFoam/shockTube/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            (sampling);

interpolationScheme cellPoint;

setFormat       raw;

sets
(
    line
    {
        type    face;
        axis    x;
        start   (-5 0 0);
        end     (5 0 0);
        nPoints 100;
    }
);

fields          ( p U.component(0) T rho );


// ************************************************************************* //
